{
    "profile": { "name": "typicode" },
    "tests": [
      { "id": 1, "title": "json-server", "author": "typicode" }
    ],
    "comments": [
      { "id": 1, "body": "some comment", "postId": 1 }
    ],
    "nodes" :
    [
        {
          "id": "d68ca91a-527b-4af9-a93b-c7e4160559c6",
          "type": "Node",
          "chilrenCount": 5,
          "parentTable": "PHA",
          "childrenTable": "Deviation",
          "index": 0,
          "parentId": "5bb9316fc9722fc1e02cfd91",
          "text": "Do mollit nulla proident dolor dolor labore dolore occaecat non ad culpa irure commodo. Lorem exercitation ut officia culpa quis nulla enim cillum in ipsum consectetur ea pariatur. Ipsum proident do fugiat consequat deserunt et aliqua aliquip ea ea dolore laboris. Non veniam dolor aliqua dolor excepteur dolore aliquip adipisicing dolor ullamco. Cupidatat dolore do ea ut consequat enim excepteur esse aute elit. Sit ad tempor sint sit sint sit tempor quis ipsum ex reprehenderit cupidatat."
        },
        {
          "id": "9a5a5d06-38e2-47c2-8b56-94bcc99c2695",
          "type": "Node",
          "chilrenCount": 0,
          "parentTable": "PHA",
          "childrenTable": "Deviation",
          "index": 1,
          "parentId": "5bb9316f8518c1b2aae5619f",
          "text": "Officia id sint laboris sit. Deserunt ad nisi esse consectetur Lorem quis consequat exercitation veniam incididunt. Aliquip sit enim veniam eu laboris dolore id veniam labore do do velit. Excepteur aliquip commodo incididunt nostrud ipsum enim adipisicing non esse minim magna in non qui. Ullamco commodo exercitation reprehenderit nisi tempor sit nulla elit veniam eu."
        },
        {
          "id": "6f91d9e5-2296-45cf-971c-ee11facd1df5",
          "type": "Node",
          "chilrenCount": 0,
          "parentTable": "PHA",
          "childrenTable": "Deviation",
          "index": 2,
          "parentId": "5bb9316f1cc999c27b044242",
          "text": "Excepteur ut in ex labore. Do ipsum occaecat sit qui labore amet laboris est fugiat deserunt pariatur. Veniam deserunt qui dolore aute officia elit culpa."
        },
        {
          "id": "bc342812-c064-4b63-93e4-8691dc94b0fd",
          "type": "Node",
          "chilrenCount": 5,
          "parentTable": "PHA",
          "childrenTable": "Deviation",
          "index": 3,
          "parentId": "5bb9316fc0f03d2fffac176e",
          "text": "Mollit ea culpa sint do magna minim minim adipisicing mollit ea. Exercitation ullamco nulla in ipsum pariatur est elit adipisicing laborum. Minim aliqua Lorem Lorem qui consequat officia excepteur laborum ad. Sit magna irure minim qui excepteur amet laborum."
        },
        {
          "id": "527e19a7-7a2e-4931-b034-cd19f9ccaa3c",
          "type": "Node",
          "chilrenCount": 0,
          "parentTable": "PHA",
          "childrenTable": "Deviation",
          "index": 4,
          "parentId": "5bb9316f0aadd618bbc7bc9c",
          "text": "Est reprehenderit culpa commodo Lorem nisi occaecat voluptate elit laboris do laboris fugiat. Amet irure ea reprehenderit qui Lorem nisi. Amet labore in Lorem sint et nisi dolore occaecat adipisicing sunt officia. Velit pariatur dolore nulla Lorem pariatur ad qui pariatur nostrud enim amet nulla eiusmod. Aliquip excepteur laboris qui occaecat."
        },
        {
          "id": "44048933-3a4a-4df2-904e-18b13cda76df",
          "type": "Node",
          "chilrenCount": 0,
          "parentTable": "PHA",
          "childrenTable": "Deviation",
          "index": 5,
          "parentId": "5bb9316fc51f584ccca0e96b",
          "text": "Et nisi aliquip dolor anim duis sit ea amet est sint. Irure laboris ex do cillum ad elit. Velit do exercitation aliquip laboris duis nulla occaecat cupidatat. Duis nisi duis duis aliquip velit enim adipisicing."
        }
      ]}